{
  "Copper": "Copper is a transition metal and trace element essential for various enzymes in the body, including cytochrome c oxidase, monoamine oxidase, and superoxide dismutase. It is commonly used in contraceptive intrauterine devices (IUDs). Copper is absorbed from the gut via high affinity copper uptake protein and likely through low affinity copper uptake protein and natural resistance-associated macrophage protein-2. Once inside the enterocyte, it is bound to copper transport protein ATOX1 which shuttles the ion to copper transporting ATPase-1 on the golgi membrane for transport into the circulation. Copper is nearly entirely bound by ceruloplasmin (65-90%), plasma albumin (18%), and alpha 2-macroglobulin (12%). Copper is incorporated into many enzymes throughout the body as an essential part of their function, including copper-containing IUDs which reduce fertility when released. Copper is approved and investigational for use in total parenteral nutrition and contraception with intrauterine devices.\n\nCopper is a solid at room temperature and has been approved for medical use since the 1970s. It is classified as part of the Copper-containing Intrauterine Device, Decreased Embryonic Implantation, Decreased Sperm Motility, Diet, Food, and Nutrition, Elements, Food, Food and Beverages, Growth Substances, Inhibit Ovum Fertilization, Metals, Heavy Metals, Micronutrients, Minerals, Physiologic categories.",
  "Oxygen": "Oxygen is an essential element for human survival, and medical oxygen therapy is used to treat a variety of conditions where there are decreased oxygen levels in the body. Oxygen therapy serves to increase blood oxygen levels and also exerts a secondary effect of decreasing blood flow resistance in the diseased lung, leading to decreased cardiovascular workload in an attempt to oxygenate the lungs. The treatment is used to treat emphysema, pneumonia, some heart disorders (congestive heart failure), and any disease that impairs the body's ability to take up and use gaseous oxygen. Hyperoxia, or higher levels of oxygen than ambient air, can be introduced under normobaric or hyperbaric conditions. The mechanism of action of oxygen therapy involves increasing the arterial pressure of oxygen and improving gas exchange and oxygen delivery to tissues, provided that there are functional alveolar units. Oxygen binds to hemoglobin in red blood cells with high affinity, determining the overall oxygen saturation level. The pharmacodynamics of oxygen therapy improve effective cellular oxygenation even at low rates of tissue perfusion and adjust hypoxic ventilatory drive by acting on chemoreceptors on carotid bodies that relay sensory information to higher processing centers in the brainstem. Additionally, oxygen molecules attenuate hypoxia-induced mitochondrial depolarization that generates reactive oxygen species and/or apoptosis.\n\nOxygen is a gas with a molecular weight of 32.0 and a topological polar surface area of 34.14. It is part of the chalcogens, elements, gases, medical gases, and miscellaneous therapeutic agents categories. Oxygen is approved and veterinarily approved, with a half-life of approximately 122.24 seconds.",
  "Flunisolide": "Flunisolide is a corticosteroid with anti-inflammatory actions, commonly marketed as AeroBid, Nasalide, or Nasarel. It is used for the maintenance treatment of asthma as a prophylactic therapy, and its mechanism of action involves activation of glucocorticoid receptors. Flunisolide binds to plasma transcortin, becoming active when not bound to this carrier protein. Its anti-inflammatory actions are thought to involve lipocortins, phospholipase A2 inhibitory proteins that control the biosynthesis of prostaglandins and leukotrienes. The immune system is suppressed by corticosteroids due to a decrease in the function of the lymphatic system, a reduction in immunoglobulin and complement concentrations, the precipitation of lymphocytopenia, and interference with antigen-antibody binding.\n\nFlunisolide is administered either as an oral metered-dose inhaler for the treatment of asthma or as a nasal spray for treating allergic rhinitis. When given as an intranasal spray, flunisolide reduces watery nasal discharge (rhinorrhea), nasal congestion, postnasal drip, sneezing, and itching on the back of the throat, which are common allergic symptoms. The half-life of flunisolide is 1.8 hours, and its molecular weight is 434.5. Flunisolide has a topological polar surface area of 93.06 and a log p value of 2.41. It belongs to the categories of Adrenal Cortex Hormones, Agents to Treat Airway Disease, Anti-Asthmatic Agents, Anti-Inflammatory Agents, Corticosteroid Hormone Receptor Agonists, Corticosteroids, and Cytochrome P-450 CYP3A Inducers. Flunisolide is approved for use but also has investigational status.",
  "Alclometasone": "Alclometasone is a synthetic glucocorticoid steroid used topically for the relief of inflammatory and pruritic manifestations of corticosteroid-responsive dermatoses. It works by binding to the corticosteroid receptor, migrating to the nucleus, and enhancing and repressing various genes involved in inflammatory pathways. The mechanism of action is unclear but involves the induction of phospholipase A2 inhibitory proteins and the regulation of arachidonic acid release and metabolism. Alclometasone is a selective glucocorticoid receptor agonist and is part of the class of primarily synthetic steroids used topically as anti-inflammatory and antipruritic agents. It is approved for use in dermatology and belongs to several drug categories, including Adrenal Cortex Hormones, Anti-Inflammatory Agents, Corticosteroid Hormone Receptor Agonists, and Corticosteroids.\n\nAlclometasone is a solid at room temperature and pressure, and its physical state can be described as a white or off-white powder. It is available in topical formulations such as creams, lotions, and ointments, and is typically applied to the affected area for a duration of several days or weeks, depending on the severity of the condition being treated.\n\nAlclometasone has several clinical indications, including the treatment of corticosteroid-responsive dermatoses such as atopic dermatitis, contact dermatitis, and seborrheic dermatitis. It is also used to treat pruritus associated with these conditions. The drug's pharmacodynamics involve binding to the corticosteroid receptor, which leads to changes in gene expression and the regulation of inflammatory pathways.\n\nIn summary, Alclometasone is a synthetic glucocorticoid steroid used topically for the relief of inflammatory and pruritic manifestations of corticosteroid-responsive dermatoses. Its mechanism of action involves the induction of phospholipase A2 inhibitory proteins and the regulation of arachidonic acid release and metabolism, leading to changes in gene expression and the inflammatory response.",
  "Medrysone": "Medrysone is a topical corticosteroid used to treat various ophthalmic conditions, including allergic conjunctivitis, vernal conjunctivitis, episcleritis, and epinephrine sensitivity. The mechanism of action of medrysone involves the induction of phospholipase A2 inhibitory proteins, which in turn regulate the biosynthesis of inflammatory mediators such as prostaglandins and leukotrienes. Medrysone binds to the glucocorticoid receptor in the cytosol, which then migrates to the nucleus and regulates the expression of genes involved in the inflammatory response. The drug inhibits edema, fibrin deposition, capillary dilation, and phagocytic migration, as well as capillary proliferation, collagen deposition, and scar formation. Medrysone is available in a solid form and has a molecular weight of 344.5. It belongs to the adrenal cortex hormones, anti-inflammatory agents, corticosteroid hormone receptor agonists, corticosteroids, cytochrome P-450 CYP3A inducers, and cytochrome P-450 CYP3A4 inducers (strength unknown) drug categories. Medrysone has a topological polar surface area of 54.37 and a logP value of 3.36. It is approved for use in ophthalmology.",
  "Fluorometholone": "Fluorometholone is a glucocorticoid employed primarily as eye drops in the treatment of corticosteroid-responsive inflammation of the palpebral and bulbar conjunctiva, cornea, and anterior segment of the globe. It has also been used topically in the treatment of various skin disorders. The mechanisms of action of ocular corticosteroids are not well understood, but it is believed that they act by inducing phospholipase A2 inhibitory proteins, collectively called lipocortins, which control the biosynthesis of potent mediators of inflammation such as prostaglandins and leukotrienes by inhibiting the release of their common precursor, arachidonic acid. The primary target of these proteins is the cytosolic glucocorticoid receptor, which binds to specific DNA sequences in the promoter region of target genes, leading to an increase in gene expression. Corticosteroids such as fluorometholone inhibit the inflammatory response to a variety of inciting agents and probably delay or slow healing by inhibiting edema, fibrin deposition, capillary dilation, leukocyte migration, capillary proliferation, fibroblast proliferation, deposition of collagen, and scar formation associated with inflammation.\n\nFluorometholone is a solid with a molecular weight of 376.47 and a topological polar surface area of 74.6. It has a logP value of 2.11. Fluorometholone belongs to the categories of Adrenal Cortex Hormones, Agents for Treatment of Hemorrhoids and Anal Fissures for Topical Use, Anti-Acne Preparations, Anti-Acne Preparations for Topical Use, Anti-Allergic Agents, Anti-Inflammatory Agents, Corticosteroid Hormone Receptor Agonists, and Corticosteroids. Its approval status is approved and investigational.",
  "Beclomethasone dipropionate": "Beclomethasone dipropionate is a synthetic corticosteroid agent and prodrug of the active metabolite 17-monopropionate (17-BMP). It is structurally similar to beclomethasone, which is a second-generation corticosteroid. Beclomethasone dipropionate is available in formulations for oral inhalation, intranasal, and topical use. Its anti-inflammatory, antipruritic, and anti-allergy properties make it useful in treating various inflammatory conditions such as asthma, allergic rhinitis, and dermatoses. The aerosol form of beclomethasone dipropionate is not indicated for the relief of acute bronchospasm. The protein binding of the main active metabolite 17-BMP was found to be 94-96% over the concentration range of 1000 to 5000 pg/mL. Beclomethasone dipropionate works by attenuating inflammatory responses associated with asthma, allergic rhinitis, nasal polyps, and corticosteroid-responsive dermatoses by suppressing the actions of inflammatory cells and inhibiting the release of inflammatory mediators. The half-life of beclomethasone dipropionate following intravenous administration was 0.5 hours, while the half-life of 17-BMP following oral and intranasal administration was 8.8 and 5.7 hours, respectively. Molecular properties such as molecular weight and topological polar surface area were also determined. Beclomethasone dipropionate is part of various drug categories and has approval status.",
  "Betamethasone": "Betamethasone is a long-acting corticosteroid with immunosuppressive and anti-inflammatory properties. It can be used topically to manage inflammatory skin conditions such as eczema, and parenterally to manage several disease states including autoimmune disorders. Betamethasone has potent glucocorticoid activity and negligible mineralocorticoid activity. The corticosteroid is indicated for the treatment of several inflammatory conditions, including topical monotherapy for pruritic and inflammatory symptoms of corticosteroid-responsive dermatoses, and as an injectable suspension to manage a range of inflammatory conditions including endocrine disorders, gastrointestinal disorders, and rheumatic disorders among other conditions. The mechanism of action of betamethasone involves inhibition of neutrophil apoptosis and demargination, and inhibition of NF-kB and other inflammatory transcription factors. It also promotes anti-inflammatory genes like interleukin-10. The protein binding of betamethasone valerate is to serum albumin and corticosteroid-binding globulin. The pharmacodynamics of corticosteroids involve binding to the glucocorticoid receptor inhibiting pro-inflammatory signals while promoting anti-inflammatory signals. Betamethasone has a wide therapeutic window, and patients who require long-term treatment with a corticosteroid should be counseled regarding the risk of hypothalamic-pituitary-adrenal axis suppression and increased susceptibility to infections. The molecular properties of betamethasone include a molecular weight of 392.47, topological polar surface area of 94.83, and log p value of 1.79. Betamethasone is part of adrenal cortex hormones; adrenals; agents causing muscle toxicity; agents for treatment of hemorrhoids and anal fissures for topical use; alimentary tract and metabolism; anti-inflammatory agents; antidiarrheals, intestinal anti-inflammatory/antiinfective agents; corticosteroids; immunosuppressants; mineralocorticoids. Betamethasone is approved for use in both humans and animals.",
  "Fluticasone Propionate": "Fluticasone propionate is a synthetic glucocorticoid drug that is available in various forms, including inhalers, nasal sprays, and topical treatments. It was first approved in 1990 for the treatment and management of asthma by prophylaxis as well as inflammatory and pruritic dermatoses. The mechanism of action of fluticasone propionate is unknown, but it is believed to affect various cell types and mediators of inflammation through its activation of glucocorticoid receptors. It also inhibits lung eosinophilia in rats. Fluticasone propionate is 99% protein bound in serum, with topical formulations binding to a lower extent. The drug has a half-life of 7.8 hours following intravenous administration and 10.8 hours following inhalation. Fluticasone propionate belongs to the adrenal cortex hormones category and is part of various drug categories, including anti-allergic agents, anti-asthmatic agents, and anti-inflammatory agents. Its molecular weight is 500.57, and its topological polar surface area is 80.67.\n\nFluticasone propionate is used to treat and manage asthma by prophylaxis, as well as inflammatory and pruritic dermatoses. Its mechanism of action is believed to involve the activation of glucocorticoid receptors, which inhibits lung eosinophilia in rats. The drug is available in various forms, including inhalers, nasal sprays, and topical treatments. Fluticasone propionate has a half-life of 7.8 hours following intravenous administration and 10.8 hours following inhalation. Its protein binding in serum is 99%, with topical formulations binding to a lower extent. The drug belongs to the adrenal cortex hormones category and is part of various drug categories, including anti-allergic agents, anti-asthmatic agents, and anti-inflammatory agents. Its molecular weight is 500.57, and its topological polar surface area is 80.67.",
  "Fluocinolone acetonide": "Fluocinolone acetonide is a corticosteroid with high lipophilicity, primarily used in dermatological preparations and recently approved by the FDA for use in implantable corticosteroid devices developed by Taro Pharmaceuticals. This drug has been extensively used in various medical areas due to its anti-inflammatory properties. Its mechanism of action involves inhibiting edema, fibrin deposition, capillary dilation, leukocyte migration, capillary proliferation, fibroblast proliferation, collagen deposition, and scar formation. Fluocinolone acetonide has a reported half-life of 1.3-1.7 hours, and its molecular weight is 452.5. It falls under the categories of Adrenal Cortex Hormones, Agents for Treatment of Hemorrhoids and Anal Fissures for Topical Use, Anti-Inflammatory Agents, Corticosteroid Hormone Receptor Agonists, Corticosteroids, Dermatological Preparations, Cytochrome P-450 CYP3A Inducers. The approved status of fluocinolone acetonide is approved and investigational, and vet_approved.\n\nThe pharmacokinetics of fluocinolone acetonide are characterized by minimal systemic absorption, resulting in a lack of relevance for protein binding and half-life determination. Instead, the drug's mechanism of action is primarily focused on its ability to inhibit inflammatory responses through vasoconstriction, suppression of membrane permeability, mitotic activity, immune response, and release of inflammatory mediators. Its topological polar surface area is 93.06, and its logP value is 2.25, indicating a low water solubility.\n\nFluocinolone acetonide has been investigated for its potential use in various medical conditions, including inflammatory skin disorders, such as atopic dermatitis, contact dermatitis, and seborrheic dermatitis, as well as for the treatment of anal fissures and hemorrhoids. Its ability to reduce inflammation and promote wound healing has led to its approval for use in implantable corticosteroid devices, providing a localized delivery of the drug directly to the affected area.",
  "Ulobetasol": "Ulobetasol is a highly potent corticosteroid that is primarily used in the treatment of severe plaque psoriasis and corticosterodermatoses. It has a structural similarity to halobetasol, but its high potency makes it more effective in treating these conditions. The mechanism of action of ulobetasol involves binding to the glucocorticoid receptor, which leads to changes in gene expression and downstream effects that occur within hours to days. Ulobetasol is bound to corticosteroid binding globulin in serum, and its protein binding profile is moderate. Its pharmacodynamics are characterized by a moderate duration of action, making it suitable for once or twice daily application. However, patients taking ulobetasol should be counselled regarding the risk of hypothalamic-pituitary-adrenal axis suppression and increased susceptibility to infections. Ulobetasol is part of several drug categories, including adrenal cortex hormones, anti-inflammatory agents, cardiovascular agents, corticosteroid hormone receptor agonists, corticosteroids, dermatological preparations, and fused-ring compounds. It has been approved for use in various countries, including the United States.\n\nIn vitro experiments have shown that halobetasol propionate, a derivative of ulobetasol, has a half-life of 33 minutes. Ulobetasol is structurally related to halobetasol, but its high potency makes it more effective in treating severe plaque psoriasis and corticosterodermatoses. The mechanism of action of ulobetasol involves binding to the glucocorticoid receptor, which leads to changes in gene expression and downstream effects that occur within hours to days. Ulobetasol is bound to corticosteroid binding globulin in serum, and its protein binding profile is moderate. Its pharmacodynamics are characterized by a moderate duration of action, making it suitable for once or twice daily application. However, patients taking ulobetasol should be counselled regarding the risk of hypothalamic-pituitary-adrenal axis suppression and increased susceptibility to infections. Ulobetasol is part of several drug categories, including adrenal cortex hormones, anti-inflammatory agents, cardiovascular agents, corticosteroid hormone receptor agonists, corticosteroids, dermatological preparations, and fused-ring compounds. It has been approved for use in various countries, including the United States.\n\nIn conclusion, ulobetasol is a highly potent corticosteroid that is primarily used in the treatment of severe plaque psoriasis and corticosterodermatoses. Its mechanism of action involves binding to the glucocorticoid receptor, which leads to changes in gene expression and downstream effects that occur within hours to days. Ulobetasol has a moderate duration of action, making it suitable for once or twice daily application. However, patients taking ulobetasol should be counselled regarding the risk of hypothalamic-pituitary-adrenal axis suppression and increased susceptibility to infections. Ulobetasol is part of several drug categories, including adrenal cortex hormones, anti-inflammatory agents, cardiovascular agents, corticosteroid hormone receptor agonists, corticosteroids, dermatological preparations, and fused-ring compounds. It has been approved for use in various countries, including the United States.",
  "Triamcinolone": "Triamcinolone is a corticosteroid used to treat various inflammatory conditions in the body, including allergic rhinitis, acute exacerbations of multiple sclerosis, and localized hypertrophic infiltrated inflammatory lesions of granuloma annulare, lichen planus, lichen simplex chronicus, and psoriatic plaques. It can be administered as a one-time adjunct treatment of osteoarthritic knee pain or as a first-line topical treatment of corticosteroid-responsive dermatoses. Triamcinolone is available in different forms, including triamcinolone hexacetonide, triamcinolone acetonide, and triamcinolone diacetate. The primary mechanism of action of triamcinolone is the inhibition of phospholipase A2 on cell membranes, preventing the breakdown of lysosomal membranes of leukocytes, which in turn prevents the formation of arachidonic acid, decreasing expression of cyclooxygenase and lipoxygenase, and thus reducing the synthesis of prostaglandins and leukotrienes. Triamcinolone also inhibits nuclear factor kappa-B, which decreases the production of pro-inflammatory signals such as interleukin-6, interleukin-8, and monocyte chemoattractant protein-1. Additionally, triamcinolone binds to corticosteroid-binding globulin or serum albumin in the plasma, with approximately 68% protein binding for triamcinolone acetonide. The half-life of triamcinolone varies depending on the formulation, ranging from 2.7 to 2.8 hours.\n\nTriamcinolone has a molecular weight of 394.44 and a topological polar surface area of 115.06. It is classified as part of Adrenal Cortex Hormones, Agents Causing Muscle Toxicity, Agents to Treat Airway Disease, Alimentary Tract and Metabolism, Anti-Inflammatory Agents, Corticosteroid Hormone Receptor Agonists, Corticosteroids, and Cortico. Triamcinolone is approved for use in various conditions and has been approved by the FDA and other regulatory agencies.",
  "Prednisone": "Prednisone is a synthetic anti-inflammatory glucocorticoid derived from cortisone. It is biologically inert and converted to its active form, prednisolone, in the liver. Prednisone is indicated for a wide range of clinical indications, including allergic, dermatologic, gastrointestinal, hematologic, ophthalmologic, nervous system, renal, respiratory, rheumatologic, infectious, endocrine, or neoplastic conditions. Its mechanism of action involves binding to the glucocorticoid receptor, inhibiting pro-inflammatory signals and promoting anti-inflammatory signals. Prednisone has a short duration of action, with a half-life of 2-3 hours, and is bound to protein in plasma to a lesser extent than other corticosteroids. Patients taking corticosteroids should be counselled regarding the risk of hypothalamic-pituitary-adrenal axis suppression and increased susceptibility to infections. Prednisone is part of Adrenal Cortex Hormones, Alimentary Tract and Metabolism, Anti-Inflammatory Agents, Antidiarrheals, Intestinal Antiinflammatory/antiinfective Agents, Antineoplastic Agents, Antineoplastic Agents, Hormonal, Corticosteroid Hormone Receptor Agonists, and Corticosteroids drug categories. Prednisone is approved for medical use and has a molecular weight of 358.43, topological polar surface area of 91.67, and log p value of 1.66.",
  "Mitotane": "Mitotane is a derivative of the insecticide dichlorodiphenyldichloroethane that specifically inhibits cells of the adrenal cortex and their production of hormones. It is used to treat inoperable adrenocortical tumors and Cushing's syndrome, causing CNS damage but no bone marrow depression. The mechanism of action of Mitotane is unknown, although it modifies the peripheral metabolism of steroids and directly suppresses the adrenal cortex. The drug has a half-life of 18-159 days and is a solid. It belongs to the categories Antineoplastic Agents, Hormonal, Antineoplastic and Immunomodulating Agents, Cytochrome P-450 CYP3A Inducers, and Cytochrome P-450 CYP3A4 Inducers (strong). Mitotane is approved for use in the treatment of inoperable adrenocortical tumors and Cushing's syndrome.\n\nPHARMACODYNAMICS: Mitotane can best be described as an adrenal cytotoxic agent, although it can cause adrenal inhibition without cellular destruction. The administration of Mitotane alters the extra-adrenal metabolism of cortisol in man, leading to a reduction in measurable 17-hydroxy corticosteroids, even though plasma levels of corticosteroids do not fall. The drug apparently causes increased formation of 6-B-hydroxyl cortisol.\n\nMECHANISM OF ACTION: The mechanism of action of Mitotane is unknown, although data are available to suggest that the drug modifies the peripheral metabolism of steroids as well as directly suppressing the adrenal cortex.\n\nPROTEIN BINDING: Mitotane has a protein binding rate of 6%.\n\nPHARMACOKINETICS: The half-life of Mitotane is 18-159 days, and it is a solid.\n\nCLINICAL INDICATION: Mitotane is used to treat inoperable adrenocortical tumors and Cushing's syndrome.\n\nDRUG CATEGORIES: Mitotane belongs to the categories Antineoplastic Agents, Hormonal, Antineoplastic and Immunomodulating Agents, Cytochrome P-450 CYP3A Inducers, and Cytochrome P-450 CYP3A4 Inducers (strong).\n\nAPPROVAL STATUS: Mitotane is approved for use in the treatment of inoperable adrenocortical tumors and Cushing's syndrome.",
  "Flumethasone": "Flumethasone is a moderately potent difluorinated corticosteroid ester with anti-inflammatory, antipruritic and vasoconstrictive properties. As it is a privately bound salt, its anti-inflammatory action is concentrated at the site of application. This local effect on diseased areas results in a prompt decrease in inflammation, exudation and itching. Flumethasone binds to plasma transcortin, and it becomes active when it is not bound to transcortin. The immune system is suppressed by corticosteroids due to a decrease in the function of the lymphatic system, a reduction in immunoglobulin and complement concentrations, the precipitation of lymphocytopenia, and interference with antigen-antibody binding. Flumethasone is part of Adrenal Cortex Hormones; Anti-Inflammatory Agents; Corticosteroids; Dermatological Preparations; Cytochrome P-450 CYP3A Substrates; Cytochrome P-450 CYP3A4 Substrates; Cytochrome P-450 Substrates and Dermato. Flumethasone is approved and vet_approved.\n\nFlumethasone is used for the treatment of contact dermatitis, atopic dermatitis, exczema, psoriasis, diaper rash and other skin conditions. The mechanism of action involves the binding to plasma transcortin, which becomes active when it is not bound to transcortin. This leads to a decrease in inflammation, exudation, and itching at the site of application. Flumethasone also suppresses the immune system by reducing the function of the lymphatic system, immunoglobulin and complement concentrations, and interfering with antigen-antibody binding.\n\nFlumethasone is a solid at room temperature and has a molecular weight of 410.46, topological polar surface area of 94.83, and logP value of 1.83. It is part of Adrenal Cortex Hormones; Anti-Inflammatory Agents; Corticosteroids; Dermatological Preparations; Cytochrome P-450 CYP3A Substrates; Cytochrome P-450 CYP3A4 Substrates; Cytochrome P-450 Substrates and Dermato. Flumethasone is approved and vet_approved for use in various skin conditions, including contact dermatitis, atopic dermatitis, exczema, psoriasis, diaper rash, and other skin conditions.",
  "Fludrocortisone": "Fludrocortisone is a synthetic mineralocorticoid used to replace endogenous corticosteroids in patients with adrenal insufficiency. It is functionally similar to cortisol, the body's primary endogenous mineralocorticoid, and is structurally analogous to prednisone, differing only by a fluorine atom at the 9-position of the steroid structure. This fluorination is thought to be crucial to fludrocortisone's significant mineralocorticoid potency. Fludrocortisone works by acting on the kidneys to increase sodium reabsorption and potassium excretion, which helps regulate plasma electrolyte composition and blood pressure. It is protein-bound in plasma, mostly to albumin and corticosteroid-binding globulin. Fludrocortisone has a relatively short plasma half-life of approximately 18-36 hours, but its effects may work over the course of 1-2 days due to its exertion at the transcriptional level. As with other systemic corticosteroids, fludrocortisone may mask signs of infection by depressing the normal immune response, and infections occurring during fludrocortisone therapy should be promptly treated with appropriate antimicrobial therapy. Fludrocortisone is approved for partial replacement therapy for primary or secondary adrenocortical insufficiency in Addison's disease, as well as the treatment of salt-losing androgenital syndrome.",
  "Hydrocortisone": "Hydrocortisone, or cortisol, is a glucocorticoid hormone produced by the adrenal cortex. It is used to treat various immune, inflammatory, and neoplastic conditions. Discovered in the 1930s by Edward Kendall and named Compound F, or 17-hydroxycorticosterone, hydrocortisone has a wide therapeutic index and moderate duration of action. Hydrocortisone binds to the glucocorticoid receptor, leading to downstream effects such as inhibition of phospholipase A2, NF-κB, and other inflammatory transcription factors, as well as promotion of anti-inflammatory genes. The drug is available in various formulations, including oral tablets, enemas, creams, and ointments. Its mechanism of action involves decreased vasodilation and permeability of capillaries, as well as decreased leukocyte migration to sites of inflammation. Hydrocortisone is bound to corticosteroid binding globulin and serum albumin in plasma, with 90.1% bound to albumin. The drug has a molecular weight of 362.47 and a topological polar surface area of 94.83. Hydrocortisone is part of several drug categories, including 11-Hydroxycorticosteroids, 17-Hydroxycorticosteroids, Adrenal Cortex Hormones, and Anti-Inflammatory Agents. It has been approved for use in various conditions, including otic solutions for infections of the external auditory canal, tablets for endocrine, rheumatic, collagen, allergic, ophthalmic, respiratory, hematologic, neoplastic, edematous, gastrointestinal, and other conditions. A hydrocortisone enema is used to treat ulcerative colitis, while a topical ointment with antibiotics is indicated for corticosteroid responsive dermatoses with infections. Oral granules of hydrocortisone are used as replacement therapy for Adrenocortical Insufficiency (AI) in children under 17 years of age. Hydrocortisone has a half-life of 2.15h via the oral route and 1.9±0.4h via an IV dose. Its molecular properties include a logP value of 1.89, indicating that it is moderately soluble in lipids. Overall, hydrocortisone is a valuable drug for managing various conditions, with its mechanism of action and formulations tailored to specific indications.",
  "Flurandrenolide": "Flurandrenolide is a topical corticosteroid used to treat various skin disorders, including dry, scaling lesions. It works by binding to the cytosolic glucocorticoid receptor, which then interacts with basic transcription factors to increase the expression of specific target genes. This leads to diminished eicosanoid production and immune system suppression. Flurandrenolide is primarily effective due to its anti-inflammatory, antipruritic, and vasoconstrictive actions. It is usually applied as a cream or ointment, but can also be combined with polyethylene tape for added adhesion. Flurandrenolide binds to plasma proteins in varying degrees, and its molecular weight is 436.52. It has a topological polar surface area of 93.06 and a logP value of 2.87. Flurandrenolide is part of Adrenal Cortex Hormones; Anti-Inflammatory Agents; Corticosteroid Hormone Receptor Agonists; Corticosteroids; Dermatological Preparations; and Cytochrome P-450 CYP3A Substrates. It is approved for use in various countries, including the United States.",
   "Aldosterone-Producing Adenoma with Seizures and Neurological Abnormalities": "Aldosterone-producing adenoma with seizures and neurological abnormalities is a rare, genetic disorder characterized by overproduction of aldosterone by an adrenal cortical adenoma, typically manifesting as primary hyperaldosteronism. This condition presents with early-onset, severe hypertension, hypokalemia, and neurological manifestations, including seizures, such as focal or generalized seizures, which can range from mild to severe and vary depending on the type of seizure. Patients may experience temporary confusion, staring spells, uncontrollable jerking movements, loss of consciousness or awareness, cognitive or emotional symptoms like fear, anxiety, or déjà vu. Additionally, they may exhibit neurological abnormalities, such as hypotonia, spasticity, cerebral palsy, and profound developmental delay/intellectual disability. The disorder is often associated with a distinctive clinical triad comprising hypertension, hypokalemia, and muscle weakness. Management of this condition typically involves treating the underlying hormonal imbalance through medication or surgical intervention to normalize aldosterone production, along with addressing seizures using anticonvulsant therapy. Patients may also require management of comorbidities, such as hypertension and electrolyte imbalances, as well as ongoing monitoring for potential complications like kidney damage and cardiac arrhythmias.",
  "Primary Aldosteronism with Neurological Abnormalities and Seizures (PANS)": "Primary Aldosteronism with Neurological Abnormalities and Seizures is a rare, genetic disorder characterized by excessive production of aldosterone by the adrenal glands. This endocrine disorder typically presents with early-onset, severe hypertension, hypokalemia, and neurological manifestations, including seizures, muscle weakness, headache, and cognitive or emotional symptoms. The overproduction of aldosterone leads to sodium and water retention, causing elevated blood pressure and potentially life-threatening complications if left untreated. Patients often exhibit a range of seizure types, including focal, generalized, absence, tonic, atonic, clonic, myoclonic, and tonic-clonic seizures, which can be mistaken for other neurological disorders or mental health conditions. The prevalence of this condition is estimated to be less than 1 in 100,000, making it an extremely rare presentation. Genetic mutations are thought to play a role in the development of PANS, although the exact underlying mechanisms are not yet fully understood. Patients with PANS require prompt medical attention to address both the endocrine and neurological aspects of their condition, as well as ongoing management to prevent complications and optimize quality of life.",
  "Ichthyosis-Alopecia-Eclabion-Ectropion-Intellectual Disability Syndrome": "Ichthyosis-Alopecia-Eclabion-Ectropion-Intellectual Disability Syndrome is a rare ectodermal dysplasia syndrome characterized by severe generalized lamellar ichthyosis at birth, accompanied by alopecia, eclabium, and ectropion. The intellectual disability component of this syndrome sets it apart from similar conditions like Sjogren-Larsson syndrome, which lacks neurologic or macular changes. Clinical presentation typically includes severe skin lesions, hair loss, and eye abnormalities, such as ectropion, with resulting complications like corneal irritation, ulcers, and vision impairment. Management involves supportive care for the intellectual disability component, as well as treatment of the associated skin and eye conditions. Given the rarity of this syndrome, prevalence is estimated to be less than 1 in 1 million individuals.",
  "Ichthyosis-Alopecia-Eclabion-Ectropion-Intellectual Disability Syndrome (IAEEDS)": "IAEEDS is a rare ectodermal dysplasia syndrome characterized by severe generalized lamellar ichthyosis at birth, accompanied by alopecia, eclabium, and ectropion. Additionally, affected individuals often present with intellectual disability. Although sharing similarities with Sjögren-Larsson syndrome, IAEEDS lacks the presence of neurologic or macular changes. The clinical presentation typically includes severe scaling skin lesions, hair loss, eyelid malformations, and intellectual impairment. Patients may also exhibit signs of ectropion, such as watery eyes, excessive dryness, irritation, sensitivity to light, and potential complications including corneal abrasions and ulcers, which can compromise vision. Despite its rarity, IAEEDS has been reported in the literature since 1987, with an estimated prevalence of less than 1 in 1 million individuals. Management of this complex syndrome requires a multidisciplinary approach, involving dermatologists, geneticists, ophthalmologists, and other specialists to address the various aspects of the condition. Early diagnosis and intervention are crucial for optimizing patient outcomes and improving quality of life.",
  "Familial Primary Pulmonary Hypoplasia": "Familial primary pulmonary hypoplasia is a rare, isolated genetic developmental defect that occurs during embryogenesis, characterized by congenital malformation of pulmonary parenchyma in the absence of other anomalies. Neonates with this condition typically present with decreased breath sounds, small lung volume, and severe respiratory distress that fails to respond to aggressive treatment including surfactant instillation and mechanical respiratory support. Notably, this condition is usually incompatible with life. The disease's genetic nature is thought to contribute to its isolated occurrence, with no other congenital anomalies or systemic manifestations present. As a result, the diagnosis of familial primary pulmonary hypoplasia is often made postnatally through the combination of clinical evaluation and radiological imaging, such as chest computed tomography or magnetic resonance imaging. Unfortunately, there are currently no effective treatment options available to improve survival or quality of life for individuals affected by this devastating condition, highlighting the need for continued research into its underlying pathophysiology and potential therapeutic targets.",
  "Myotonia Fluctuans": "Myotonia fluctuans is an autosomal dominant inherited disorder caused by mutations of the scn4a gene, characterized by a unique combination of potassium-aggravated myotonia and dramatic fluctuations in muscle stiffness. This condition typically develops during childhood or adolescence, with eyelid myotonia often being the initial symptom. Fluctuating episodes of myotonia affect various muscles, including extraocular, bulbar, and limb muscles, and are triggered by a delayed onset (10-30 minutes) after exercise, as well as exacerbated by potassium ingestion. In contrast to other forms of myotonia, cold has no effect on the symptoms. While paralysis is never observed, episodic weakness is relatively rare. The prevalence of this condition remains unknown. Management of myotonia fluctuans primarily focuses on dietary modifications to minimize potassium intake, with some patients experiencing significant improvement in symptom control through such measures.",
  "Hereditary Progressive Mucinous Histiocytosis": "Hereditary progressive mucinous histiocytosis is a rare, benign, non-Langerhans cell histiocytosis that typically presents in childhood or adolescence with the development of multiple, small, asymptomatic papules. These skin-colored to red-brown lesions exhibit a predilection for the face, dorsal hands, forearms, and legs, without any associated mucosal or visceral involvement. Histopathologically, the papules are characterized by well-circumscribed, unencapsulated, nodular aggregates of histiocytes with abundant mucin in the upper and middermis. This disease is diagnosed based on clinical and histological findings, as there is no specific laboratory test available. Hereditary progressive mucinous histiocytosis is a self-limiting condition, meaning it does not undergo significant change or progression over time, and therefore, management typically focuses on reassurance and cosmetic treatment options to address any concerns regarding appearance. With an estimated prevalence of less than 1 in 1 million individuals, this disease is considered extremely rare, making it essential for clinicians to be aware of its unique characteristics to ensure accurate diagnosis and appropriate care.",
  "Mal de Debarquement": "Mal de Debarquement is a rare otorhinolaryngological disease characterized by a persistent sensation of motion, including rocking, swaying, tumbling, and/or bobbing, which typically develops following exposure to passive movement, such as ocean cruises or other types of water, train, automobile, or air travel. Onset may be spontaneous in some patients, whereas others experience manifestations shortly after the stimulus. The disease persists for 6 months to years, often accompanied by anxiety, fatigue, and impaired cognition. Symptoms are frequently exacerbated when in an enclosed space or attempting to remain motionless (sitting, lying down, or standing still), but tend to subside when in passive motion, such as during a moving car, airplane, or train ride.",
  "Primary Lateral Sclerosis (PLS)": "Primary lateral sclerosis (PLS) is an idiopathic motor neuron disease characterized by slowly progressive upper motor neuron dysfunction, leading to spasticity, mild weakness in voluntary muscle movement, hyperreflexia, and loss of motor speech production. This neurodegenerative disorder typically affects adult individuals, although a rare juvenile form exists. PLS is not familial, and its cause remains unknown for the adult-onset variant, whereas genetic mutations in the ALS2 gene are responsible for the juvenile form. The disease progresses slowly over years, with symptoms initially manifesting in the legs, often starting in one leg, and gradually affecting the trunk, arms, hands, tongue, and jaw. As the disease advances, patients may experience hoarseness, slowed and slurred speech, drooling, difficulties with swallowing, and potentially respiratory compromise. While the average progression of PLS lasts around 20 years, its effects are highly variable, and some individuals may eventually require assistive devices or wheelchairs to maintain mobility. Adult-onset PLS is not typically associated with a shortened life expectancy, but it can significantly impact quality of life as more muscles become disabled, increasing the risk of falls and injuries. Prompt medical attention is essential for diagnosis and management, particularly when persistent problems with stiffness, weakness, swallowing, or speaking arise.",
  "Kelley-Seegmiller Syndrome": "Kelley-Seegmiller Syndrome, also known as hypoxanthine guanine phosphoribosyltransferase partial deficiency, is a hereditary disorder of purine metabolism characterized by uric acid overproduction leading to urolithiasis and early-onset gout. Typically affecting males, with heterozygous females acting as carriers, this condition usually presents in infancy or early adulthood with the appearance of orange crystals in diapers, followed by symptoms such as urolithiasis, uric acid nephropathy, urinary infections, and renal obstruction. Gout may emerge after puberty, often accompanied by acute arthritis or tophi. Notably, dystonia is generally mild or absent, unlike Lesch-Nyhan syndrome, which distinguishes KSS from other HPRT deficiencies. Patients typically exhibit normal intelligence alongside varying degrees of attention deficit, but compulsive self-injurious behavior is absent. Management and treatment involve managing uric acid overproduction, nephrolithiasis, gouty arthritis, and tophi through allopurinol, urine alkalinization, and generous hydration, with careful dosage adjustments necessary to avoid xanthine lithiasis.",
  "Autosomal Recessive Cutis Laxa Type 2, Classic Type": "Autosomal recessive cutis laxa type 2, classic type is a rare genetic disorder characterized by a distinctive clinical presentation of premature aging features, including wrinkled and sagging skin, prominent veins, and loose, inelastic skin. The condition typically presents in early childhood, with the characteristic skin changes becoming more pronounced over time. Affected individuals often exhibit a spectrum of systemic manifestations, including joint laxity, hyperextensibility of joints, and an increased risk of premature aging-related disorders such as atherosclerosis and osteoporosis. In addition to these physical characteristics, patients may also experience cognitive impairment, growth retardation, and an increased susceptibility to infections. The disease is caused by mutations in the FBLN5 gene, which codes for fibrillin-5, a protein essential for maintaining skin elasticity and integrity. Autosomal recessive cutis laxa type 2, classic type follows an autosomal recessive pattern of inheritance, meaning that affected individuals are homozygous or compound heterozygous for the causative mutation. Diagnosis is typically made through clinical evaluation and molecular genetic testing. While there is currently no cure for this condition, management involves a multidisciplinary approach, including physical therapy to address joint laxity and hyperextensibility, as well as treatment of associated comorbidities such as osteoporosis and premature aging-related disorders.",
  "Hereditary Coproporphyria": "Hereditary coproporphyria is an autosomal dominant inherited disorder characterized by deficiency of the enzyme coproporphyrinogen oxidase, resulting in neurologic damage and a range of symptoms. The disease typically manifests after puberty and preferentially affects women, with 85-95% of cases presenting as intense abdominal pain accompanied by neurological and psychological symptoms such as irritability, emotionality, depression, anxiety, hallucinations, disorientation, and mental confusion. Tachycardia and hyponatremia are common during attacks, which can be triggered by exogenous factors like porphyrinogenic drugs, alcohol, infections, or stress, or endogenous factors linked to hormonal fluctuations. In approximately 30% of cases, patients present with cutaneous lesions as a result of photosensitivity, characterized by bullae that cause pain and leave hyperpigmented scars. Urgent treatment is required for acute attacks, involving injection of human hemin and/or perfusion of carbohydrates, followed by management aimed at suppressing triggering factors, relieving symptoms, and preventing future attacks through avoidance of porphyrinogenic substances and stress reduction. Complications can include dehydration, breathing problems, seizures, high blood pressure, chronic pain, kidney failure, liver damage, and permanent skin damage. While there is no cure for hereditary coproporphyria, early detection and management can significantly improve patient outcomes.",
  "Acute Intermittent Porphyria": "Acute intermittent porphyria is an autosomal dominant disorder characterized by recurrent and life-threatening neuro-visceral attacks without cutaneous manifestations. The disease is caused by a deficiency of hydroxymethylbilane synthase, the third enzyme in the 8-enzyme biosynthetic pathway of heme, leading to elevated levels of aminolevulinic acid and porphobilinogen in urine. Clinical features include recurrent neurologic disturbances, abdominal pain, and elevated levels of aminolevulinic acid and porphobilinogen in urine, often triggered by exogenous or endogenous factors such as porphyrinogenic drugs, alcohol, infections, stress, hormonal changes, and menstrual cycles. Symptoms may last days to weeks and usually improve slowly after the attack. Urgent treatment with an injection of human hemin and/or perfusion of carbohydrates is required during acute attacks, which can be life-threatening if not promptly treated. Management includes suppressing triggering factors, relieving pain and anxiety, and preventing attacks by avoiding triggers and using medications such as opiate analgesics. Long-term complications may include chronic pain, chronic kidney failure, liver damage, and permanent skin damage in cases of cutaneous porphyria. Genetic testing and counseling are important for family members to determine their risk of inheriting the disease. Early recognition and treatment are crucial to prevent severe complications and improve patient outcomes.",
  "Hyperimmunoglobulin G1(A1) Syndrome": "Hyperimmunoglobulin G1(A1) syndrome is a rare immunodeficiency disorder characterized by elevated levels of immunoglobulin G (IgG) subclass 1, particularly the A1 subtype. Clinically, affected individuals typically present with recurrent sinopulmonary infections, often involving the lungs and sinuses, despite normal total IgG levels. The syndrome may also be accompanied by granulomatous diseases, such as sarcoidosis-like reactions, and an increased risk of developing autoimmune disorders, including thyroiditis and lupus. Epidemiological studies suggest that hyperimmunoglobulin G1(A1) syndrome is a heterogeneous disorder with varying modes of inheritance, including autosomal dominant, recessive, and X-linked patterns. Management of the disease typically involves antibiotic therapy for infections, corticosteroids to control granulomatous inflammation, and immunosuppressive agents to prevent or treat autoimmune manifestations. In some cases, bone marrow transplantation may be necessary to correct the underlying immune dysfunction. While the syndrome is rare, prompt recognition and management are crucial to improve clinical outcomes and reduce morbidity in affected individuals.",
  "Agenesis of the Corpus Callosum and Congenital Lymphedema": "Agenesis of the corpus callosum, a rare developmental disorder, is often accompanied by congenital lymphedema, characterized by swelling, heaviness, or tightness in one or more limbs. The latter arises from impaired lymphatic vessel development, leading to inadequate drainage of lymph fluid. Primary lymphedema can occur on its own, while secondary lymphedema results from damage to lymph nodes or vessels caused by various conditions, including surgery, radiation therapy, cancer, infection, and trauma. Clinical presentation typically involves chronic swelling, restricted range of motion, recurring infections, skin thickening, and aching discomfort. Patients with agenesis of the corpus callosum and congenital lymphedema may also experience cognitive and behavioral impairments due to the underlying brain malformation. Epidemiologically, this rare condition is more common in females than males, often presenting at birth or early childhood. Management involves prevention strategies, such as protecting affected limbs from injury, avoiding tight clothing, and maintaining good skin care; compression garments and physical therapy may also be employed to reduce swelling. Regular monitoring for signs of infection and lymphangiosarcoma is crucial, particularly in patients with a history of cancer treatment. When symptoms persist or worsen, prompt medical attention is necessary to prevent complications and ensure optimal quality of life.",
  "Posterior Column Ataxia": "Posterior column ataxia is a neurological disorder characterized by progressive damage to the posterior columns of the spinal cord, leading to impaired muscle coordination and balance. The primary symptom is ataxia, which can develop over time or present suddenly, manifesting as poor coordination, unsteady gait, and difficulty with fine motor tasks such as eating, writing, or buttoning a shirt. Additional signs may include involuntary back-and-forth eye movements, difficulty swallowing, and changes in speech. Causes of posterior column ataxia are diverse and can be attributed to damage, degeneration, or loss of nerve cells in the cerebellum, spinal cord, or peripheral nerves. Underlying conditions that may cause ataxia include head trauma, stroke, cerebral palsy, autoimmune diseases such as multiple sclerosis and sarcoidosis, infections like chickenpox and Lyme disease, paraneoplastic syndromes, abnormalities in the brain, toxic reactions to certain medications, vitamin B-6 toxicity, alcohol and drug intoxication, heavy metal poisoning, and solvent poisoning. In some cases, no specific cause can be identified, and sporadic ataxia may present as a progressive, degenerative disorder or hereditary condition. Autosomal dominant ataxias, including spinocerebellar ataxias, episodic ataxias, and Friedreich's ataxia, are characterized by poor coordination, but each has distinct signs and symptoms. Autosomal recessive ataxias, such as ataxia-telangiectasia and congenital cerebellar ataxia, are rare and typically present in childhood. Wilson's disease is another condition that can cause ataxia due to copper accumulation. When ataxia is suspected or diagnosed, prompt medical attention is necessary to rule out underlying conditions and initiate appropriate management, which may include physical therapy, medications, and lifestyle modifications.",
  "Absence Deformity of Leg-Cataract Syndrome": "Absence deformity of leg-cataract syndrome is a rare and debilitating congenital condition characterized by the absence deformity of one leg, accompanied by progressive scoliosis, short stature, and congenital cataract associated with dysplasia of the optic nerve. This syndromic limb malformation has been reported in only two cases, both occurring in unrelated boys, since its initial description in 1968. Notably, intellectual deficits have not been observed in affected individuals. Clinically, patients typically present with a notable absence deformity of one leg, often accompanied by scoliosis that worsens over time, leading to significant mobility and quality-of-life impairments. Additionally, congenital cataracts and optic nerve dysplasia contribute to visual disturbances, emphasizing the importance of multidisciplinary management and early intervention. With an estimated prevalence of less than 1 in 1 million, this syndrome remains a rare but important consideration for clinicians managing pediatric patients with limb malformations and ophthalmic disorders.",
  "Arteriovenous Malformations of the Brain": "Arteriovenous malformations of the brain, also known as cerebral arteriovenous malformations (AVMs), are congenital malformative communications between veins and arteries in the brain, characterized by a nidus composed of dilated and tangled supplying arterioles and drainage veins with no intervening capillary bed. These abnormalities can be asymptomatic or manifest as headaches of varying severity, generalized or focal seizures, focal neurological defects, such as weakness, numbness, speech difficulties, and vision loss, or potentially fatal intracranial hemorrhage in the event of rupture. The location and size of the AVM significantly impact clinical presentation, with symptoms varying depending on the affected region. While some AVMs may be asymptomatic, bleeding is a common complication that can cause significant neurological damage and even death if left untreated. Rarely, certain hereditary conditions, such as hereditary hemorrhagic telangiectasia, may increase an individual's risk of developing an AVM. Diagnosis typically occurs incidentally, following imaging studies like CT or MRI scans, often unrelated to the underlying AVM. Prompt medical attention is essential when symptoms arise, and management usually involves a multidisciplinary approach incorporating neuroimaging, interventional neuroradiology, and surgical techniques to minimize the risk of bleeding and optimize patient outcomes."
}